DataProcessors/бит_ВыгрузкаВГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ВыгрузкаВГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидВыгрузкиГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСтраницыExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаНач1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаНач2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаНач3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогНач1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогНач2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогНач3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизацииВладельцаЖилФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизацииПредоставившейСведенияОНачислениях</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКолонокExcel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_ИмяФайлаКвартиросъемщики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_ИмяФайлаОплатыУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_ИмяФайлаСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиExcel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РегионыВыгрузкиВГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/бит_РегионыВыгрузкиВГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_РегионыВыгрузкиВГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Москва</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иркутск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрасноярскийКрай</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидВыгрузкиГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидВыгрузкиГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/бит_ВыгрузкаВГЦЖС/Ext/ObjectModule.bsl
#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РегионВыгрузки = Перечисления.бит_РегионыВыгрузкиВГЦЖС.Москва Тогда
		
		НеПроверятьРеквизиты = Новый Массив;
		
		НеПроверятьРеквизиты.Добавить("КоличествоКолонокExcel");
		НеПроверятьРеквизиты.Добавить("ИмяСтраницыExcel");
		НеПроверятьРеквизиты.Добавить("НомерСтрокиExcel");
		НеПроверятьРеквизиты.Добавить("ФайлExcel");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаКвартиросъемщики");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаОплатыУслуг");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаСведения");
		НеПроверятьРеквизиты.Добавить("кр_Каталог");
		НеПроверятьРеквизиты.Добавить("кр_Кодировка");
		
		Если ВидВыгрузки = Перечисления.бит_ВидВыгрузкиГЦЖС.Льготы Тогда
			
			НеПроверятьРеквизиты.Добавить("КодОрганизацииВладельцаЖилФонда");
			НеПроверятьРеквизиты.Добавить("КодОрганизацииПредоставившейСведенияОНачислениях");
			НеПроверятьРеквизиты.Добавить("ИмяФайлаНач1");
			НеПроверятьРеквизиты.Добавить("ИмяФайлаНач2");
			НеПроверятьРеквизиты.Добавить("ИмяФайлаНач3");
			НеПроверятьРеквизиты.Добавить("КаталогНач1");
			НеПроверятьРеквизиты.Добавить("КаталогНач2");
			НеПроверятьРеквизиты.Добавить("КаталогНач3");
			
			Для каждого Элемент Из НеПроверятьРеквизиты Цикл
				
				Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
				
				Если НЕ Реквизит = Неопределено Тогда
					
					ПроверяемыеРеквизиты.Удалить(Реквизит);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		ИначеЕсли ВидВыгрузки = Перечисления.бит_ВидВыгрузкиГЦЖС.Начисления Тогда
			
			НеПроверятьРеквизиты.Добавить("НомерДоговора");
			НеПроверятьРеквизиты.Добавить("ИмяФайла");
			НеПроверятьРеквизиты.Добавить("Каталог");
			
			Для каждого Элемент Из НеПроверятьРеквизиты Цикл
				
				Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
				
				Если НЕ Реквизит = Неопределено Тогда
					
					ПроверяемыеРеквизиты.Удалить(Реквизит);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
	ИначеЕсли РегионВыгрузки = Перечисления.бит_РегионыВыгрузкиВГЦЖС.Иркутск Тогда
		
		НеПроверятьРеквизиты = Новый Массив;
		НеПроверятьРеквизиты.Добавить("КодОрганизацииВладельцаЖилФонда");
		НеПроверятьРеквизиты.Добавить("КодОрганизацииПредоставившейСведенияОНачислениях");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач1");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач2");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач3");
		НеПроверятьРеквизиты.Добавить("КаталогНач1");
		НеПроверятьРеквизиты.Добавить("КаталогНач2");
		НеПроверятьРеквизиты.Добавить("КаталогНач3");
		НеПроверятьРеквизиты.Добавить("НомерДоговора");
		НеПроверятьРеквизиты.Добавить("ИмяФайла");
		НеПроверятьРеквизиты.Добавить("Каталог");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаКвартиросъемщики");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаОплатыУслуг");
		НеПроверятьРеквизиты.Добавить("кр_ИмяФайлаСведения");
		НеПроверятьРеквизиты.Добавить("кр_Каталог");
		НеПроверятьРеквизиты.Добавить("кр_Кодировка");
		
		Для каждого Элемент Из НеПроверятьРеквизиты Цикл
			
			Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
			
			Если НЕ Реквизит = Неопределено Тогда
				
				ПроверяемыеРеквизиты.Удалить(Реквизит);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	ИначеЕсли РегионВыгрузки = Перечисления.бит_РегионыВыгрузкиВГЦЖС.КрасноярскийКрай Тогда
		
		НеПроверятьРеквизиты = Новый Массив;
		НеПроверятьРеквизиты.Добавить("КоличествоКолонокExcel");
		НеПроверятьРеквизиты.Добавить("ИмяСтраницыExcel");
		НеПроверятьРеквизиты.Добавить("НомерСтрокиExcel");
		НеПроверятьРеквизиты.Добавить("ФайлExcel");
		НеПроверятьРеквизиты.Добавить("КодОрганизацииВладельцаЖилФонда");
		НеПроверятьРеквизиты.Добавить("КодОрганизацииПредоставившейСведенияОНачислениях");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач1");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач2");
		НеПроверятьРеквизиты.Добавить("ИмяФайлаНач3");
		НеПроверятьРеквизиты.Добавить("КаталогНач1");
		НеПроверятьРеквизиты.Добавить("КаталогНач2");
		НеПроверятьРеквизиты.Добавить("КаталогНач3");
		НеПроверятьРеквизиты.Добавить("НомерДоговора");
		НеПроверятьРеквизиты.Добавить("ИмяФайла");
		НеПроверятьРеквизиты.Добавить("Каталог");
		
		Для каждого Элемент Из НеПроверятьРеквизиты Цикл
			
			Реквизит = ПроверяемыеРеквизиты.Найти(Элемент);
			
			Если НЕ Реквизит = Неопределено Тогда
				
				ПроверяемыеРеквизиты.Удалить(Реквизит);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
